tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "romkatv/powerlevel10k"
brew "bat"
brew "create-dmg"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gcc"
brew "git"
brew "python@3.13"
brew "glances"
brew "jq"
brew "lazygit"
brew "mysql"
brew "navi"
brew "neovim"
brew "node"
brew "powerlevel10k"
brew "ripgrep"
brew "tmux"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
brew "koekeishiya/formulae/skhd", args: ["HEAD"]
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "gimp"
cask "zen"
vscode "vscodevim.vim"
