tap "anomalyco/tap"
tap "koekeishiya/formulae"
tap "localstack/tap"
tap "mhaeuser/mhaeuser"
tap "nikitabobko/tap"
tap "romkatv/powerlevel10k"
tap "spring-io/tap"
brew "bat"
brew "create-dmg"
brew "curl"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gcc"
brew "git"
brew "htop"
brew "jq"
brew "node"
brew "jupyterlab"
brew "lazygit"
brew "openjdk"
brew "maven"
brew "minikube"
brew "navi"
brew "neovim"
brew "powerlevel10k"
brew "python@3.13"
brew "ripgrep"
brew "rust"
brew "rustup"
brew "stow"
brew "tmux"
brew "uv"
brew "wget"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
brew "anomalyco/tap/opencode"
brew "koekeishiya/formulae/skhd", args: ["HEAD"]
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
brew "localstack/tap/localstack-cli"
brew "spring-io/tap/spring-boot"
cask "chatgpt"
cask "codex"
cask "docker-desktop"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "gimp"
cask "karabiner-elements"
cask "visual-studio-code"
cask "zen"
cargo "rustlings"
