tap "koekeishiya/formulae"
tap "mhaeuser/mhaeuser"
tap "nikitabobko/tap"
tap "romkatv/powerlevel10k"
tap "spring-io/tap"
brew "bat"
brew "create-dmg"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gcc"
brew "git"
brew "jq"
brew "node"
brew "python@3.13"
brew "jupyterlab"
brew "lazygit"
brew "openjdk"
brew "maven"
brew "navi"
brew "neovim"
brew "powerlevel10k"
brew "ripgrep"
brew "rust"
brew "rustup"
brew "stow"
brew "tmux"
brew "uv"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
brew "koekeishiya/formulae/skhd", args: ["HEAD"]
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
brew "spring-io/tap/spring-boot"
cask "battery-toolkit"
cask "chatgpt"
cask "codex"
cask "docker-desktop"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "gimp"
cask "karabiner-elements"
cask "stretchly"
cask "time-out"
cask "zen"
vscode "anysphere.cursorpyright"
vscode "anysphere.remote-ssh"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "redhat.java"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
cargo "rustlings"
